uhnp/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>тн_НеОтражатьВУУ</name>
    <comment>// Гутарова Екатерина 03.05.2023 Выполнение задач №000045368</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласуетсяВДокументообороте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ДокументыБД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Синоним");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Синоним) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Синоним;
	КонецЕсли;
	
КонецПроцедуры

#Область КлючевыеРеквизиты

// Функция - Получить реквизиты по типу
//
// Параметры:
//  Объект				 - <СправочникСсылка.ДокументыБД>,<СправочникОбъект.ДокументыБД>, Структура - Объект для поиска в ТЧ
//  ПолноеИмяТипДанных	 - <Строка>	 - ТипДанных
//  ИмяРеквизита		 - 	 - 
// 
// Возвращаемое значение: <СписокЗначений(Имя, Синоним, Пометка)> - список содержащий: 
//   - имя реквизита, Синоним реквизита, Пометка о соответствии переданному "ИмяРеквизита"
//
Функция ПолучитьРеквизитыПоТипу(Объект, ПолноеИмяМетаданных, ИмяРеквизита = Неопределено) Экспорт

	Результат = Новый СписокЗначений;
	
	Для Каждого Строка ИЗ Объект.Реквизиты Цикл
		
		Если НЕ СтрНайти(Строка.ТипДанных, ПолноеИмяМетаданных) > 0 Тогда			
			Продолжить;			
		КонецЕсли;
		
		Результат.Добавить(Строка.Имя, Строка.Синоним, ИмяРеквизита = Строка.Имя);
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Обновление

Процедура ЗаполнитьКлючевыеРеквизитыМСФОПоУмолчанию() Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка
	|ИЗ
	|	Справочник.ДокументыБД.Реквизиты КАК т
	|ГДЕ
	|	т.Имя В (""Сумма"", ""ДоговорКонтрагента"", ""Контрагент"")
	|	И т.Ссылка.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)");
	
	ИменаРеквизитов = Новый Структура("Сумма,ДоговорКонтрагента,Контрагент", "РеквизитСуммыДокумента", "РеквизитДоговорКонтрагента", "РеквизитКонтрагент");
	ТипыРеквизитов = Новый Структура("Сумма,ДоговорКонтрагента,Контрагент", "Число", "Справочник.ДоговорыКонтрагентов", "РеквизитКонтрагент");
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		ОбъектБД = Выборка.Ссылка.ПолучитьОбъект();
		ЕстьИзменение = Ложь;
		
		Для каждого ИмяРекв Из ИменаРеквизитов Цикл
		
			Если ЗначениеЗаполнено(ОбъектБД[ИмяРекв.Значение]) Тогда
				// уже заполнено
				Если ОбъектБД.Реквизиты.Найти(ОбъектБД[ИмяРекв.Значение], "Имя") = Неопределено Тогда
					ОбъектБД[ИмяРекв.Значение] = "";// неактуальный реквизит
					ЕстьИзменение = Истина;
				Иначе 
					Продолжить;	
				КонецЕсли;				
			КонецЕсли;	
			
			СтрокиРекв = ОбъектБД.Реквизиты.НайтиСтроки(Новый Структура("Имя,ТипДанных", ИмяРекв.Ключ, ТипыРеквизитов[ИмяРекв.Ключ]));
			Если СтрокиРекв.Количество() Тогда
				ОбъектБД[ИмяРекв.Значение] = ИмяРекв.Ключ;
				ЕстьИзменение = Истина;
			КонецЕсли;
		
		КонецЦикла;
		
		Если ЕстьИзменение Тогда		
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектБД);		
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#КонецЕсли
